In [37]:
# Dependencies and Setup
import pandas as pd

In [38]:
# File to Load (Remember to Change These)
file_to_load = "C:/Users/JPHeb/JPH-Data-Class/pandas-challenge/Heroes_of_Pymoli/Resources/purchase_data.csv"

In [39]:
# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(file_to_load)

In [40]:
#purchase_data_df.head
#purchase_data_df.head

In [41]:
#decribe
#purchase_data_df.describe()

In [42]:
#iterating the columns and Rename SN to Username
purchase_data_df.rename(columns = {'SN':'Username'}, inplace = True)
# iterating the columns 
for col in purchase_data_df.columns: 
    print(col)

Purchase ID
Username
Age
Gender
Item ID
Item Name
Price

In [43]:
# The unique method shows every element of the series that appears only once
unique = purchase_data_df["Username"].unique()
#unique
#players_count = len(unique)
#print(players_count)

In [44]:
# initialize list of lists 
total_players = {'Total Players':[players_count]}
print(total_players)
# Create the pandas DataFrame 
total_players_df = pd.DataFrame(total_players)
total_players_df

{'Total Players': [576]}

   Total Players
0            576

In [45]:
purchase_data_df2 = purchase_data_df.loc[:, ["Gender", "Username", "Age"]]
purchase_data_df2

     Gender       Username  Age
0      Male        Lisim78   20
1      Male    Lisovynya38   40
2      Male     Ithergue48   24
3      Male  Chamassasya86   24
4      Male      Iskosia90   23
..      ...            ...  ...
775  Female     Aethedru70   21
776    Male         Iral74   21
777    Male     Yathecal72   20
778    Male        Sisur91    7
779    Male      Ennrian78   24

[780 rows x 3 columns]

In [46]:
dropped_username = purchase_data_df2.drop_duplicates()
dropped_username

     Gender       Username  Age
0      Male        Lisim78   20
1      Male    Lisovynya38   40
2      Male     Ithergue48   24
3      Male  Chamassasya86   24
4      Male      Iskosia90   23
..      ...            ...  ...
773    Male         Hala31   21
774    Male     Jiskjask80   11
775  Female     Aethedru70   21
777    Male     Yathecal72   20
778    Male        Sisur91    7

[576 rows x 3 columns]

In [47]:
Gender_count = dropped_username["Gender"].value_counts()
Gender_count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [48]:
Gender_count_df = pd.DataFrame(Gender_count)
Gender_count_df

                       Gender
Male                      484
Female                     81
Other / Non-Disclosed      11